<html>
<head>
<title>Jeremy Tammik</title>
<meta http-equiv="content-type" content="text/html; charset=Windows-1252">
<link rel="stylesheet" type="text/css" href="../../jet.css">
</head>
<body>
<h1>Sprache</h1>
<ul>
<li>Englisch - Muttersprache</li>
<li>Deutsch - derzeitige Hauptsprache</li>
<li>Franz&ouml;sisch - flie&szlig;end</li>
<li>Spanisch - flie&szlig;end</li>
<li>Schwedisch - fr&uuml;here Hauptsprache</li>
</ul>
<p>Meine Sprachkenntnisse sind auf unterschiedliche Art zustandegekommen. Sie zeugen vor allem f&uuml;r mein Interesse an Kommunikation, Verst&auml;ndnis meiner Mitmenschen, und Anpassungsf&auml;higkeit. Mein Interesse an Kommunikation hat viel mit Effizienz, Probleml&ouml;sung und Arbeitsteilung zu tun.</p>
<ul>
<li>Englisch ist meine Muttersprache und wurde bei uns zu Hause gesprochen, da meine Mutter Engl&auml;nderin ist.</li>
<li>Schwedisch lernte ich in der Schule und auf der Stra&szlig;e w&auml;hrend meiner 15 Jahre in Schweden.</li>
<li>Deutsch lernte ich in der Deutschen Auslandschule in Stockholm und perfektionierte es anschlie&szlig;end w&auml;hrend des Studiums und der Berufsaus&uuml;bung in Deutschland.</li>
<li>Franz&ouml;sisch lernte ich auch zun&auml;chst in der Schule; flie&szlig;end beherrsche ich es erst seit mehreren l&auml;ngeren Aufenthalten in Frankreich nach Abschluss der Schule.</li>
<li>Spanisch lernte ich in Spanien, wo meine Mutter seit 1982 wohnhaft ist und ich ein Haus besitze.</li>
</ul>
<p>Interessehalber lernte ich auch T&uuml;rkisch und Italienisch, baute diese Kenntnisse aber nicht weiter aus.</p>
<p>Ich habe f&uuml;r verschiedene Institute als &Uuml;bersetzer f&uuml;r Englisch und Schwedisch von und ins Deutsche gearbeitet.</p>
<p>Mein Interesse an Kommunikation, Effizienz und Arbeitsteilung f&uuml;hrte zu vielen Ver&ouml;ffentlichungen auf Deutsch und Englisch, unter anderem auch je ein Buch in den beiden Sprachen. W&auml;hrend meiner T&auml;tigkeit bei CPP Software war ich fachjournalistisch und redaktionell an der Erstellung der Fachzeitschrift "Clipboard" beteiligt. Bei Autodesk publizierte ich freiberuflich Artikel &uuml;ber AutoCAD-Programmierung in verschiedenen Europ&auml;ischen und US-Amerikanischen Fachzeitschriften. Siehe hierzu bitte den Abschnitt Publikation.</p>
<p>Nebenbei bemerkt interessiere ich mich auch f&uuml;r Sch&ouml;nliteratur. Meine derzeitigen Lieblingsautoren sind Jose Saramago und Kazuo Ishiguro.</p>
</body>
</html>
