<html>
<head>
<title>Jeremy Tammik</title>
<meta http-equiv="content-type" content="text/html; charset=Windows-1252">
<link rel="stylesheet" type="text/css" href="../../jet.css">
</head>
<body>
<h1>Pr&auml;sentation</h1>

<ul>
<li>Didaktik</li>
<li>Tutorien</li>
<li>Erwachsenenkurse</li>
<li>Programmiererseminare</li>
<li>Konferenzkonzeption, -Gestaltung, -Leitung und Pr&auml;sentation</li>
<li>Technology Evangelist</li>
</ul>

<p>Meine Besch&auml;ftigung mit Didaktik und Pr&auml;sentation begann schon w&auml;hrend des 
Studiums als Tutor f&uuml;r reine Mathematik (Funktionentheorie), angewandte 
Mathematik (Numerik) und Programmierkurse in Basic und Pascal.</p>

<p>Nach dem Studium hielt ich Kurse f&uuml;r Erwachsene in Schwedisch und Basic, 
die ich zum Teil selbst ausarbeitete.</p>

<p>Bei CPP Software leitete ich Seminare zur Einarbeitung erfahrener 
Programmierer in die GEM API f&uuml;r verschiedene Gro&szlig;kunden (GAI, Dornier, Siemens), 
und war neben dem reinen Programmieren auch f&uuml;r Textverarbeitung, 
Desktop Publishing, Artikel &uuml;ber Programmierung und den telefonischen 
Support von GEM-Programmierern zust&auml;ndig.</p>

<p>Meine Hauptaufgabe bei Autodesk war die Aufbereitung und Weitergabe 
von Informationen &uuml;ber die AutoCAD APIs (Application Programming Interface) 
an externe Applikationsentwickler, sogenannte "third party application 
developers", zun&auml;chst auf Europa beschr&auml;nkt, sp&auml;ter auch in S&uuml;dafrika, 
Australien und USA. Anfangs war ich dem Autodesk-B&uuml;ro in Basel angeschlossen, 
sp&auml;ter dem Developer Support in dem European Technical Centre in Neuch&acirc;tel.</p>

<p>In 1988 war mein erste Aufgabe die Erstellung eines Trainingsprogramms 
f&uuml;r AutoLISP und den anderen damaligen M&ouml;glichkeiten, AutoCAD programmatisch 
zu steuern. Dazu habe ich mich erst in die Programmiersprache Lisp eingearbeitet, 
dann Vortr&auml;ge und Programmierkurse f&uuml;r AutoLISP konzipiert, entwickelt, 
ausgearbeitet und gehalten. In 1990 kam in AutoCAD eine neue C-Schnittstelle hinzu, 
das sogenannte ADS oder AutoCAD Application Development System. Meine schon 
vorhandene eingehende Erfahrung mit der Programmiersprache C wurde pl&ouml;tzlich sehr 
n&uuml;tzlich. In 1994 kam schlie&szlig;lich noch eine C++ Schnittstelle in AutoCAD hinzu, 
das ObjectARX oder object-oriented AutoCAD Runtime Extension.</p>

<p>F&uuml;r alle drei APIs habe ich Konferenzen organisiert, komplette Kursunterlagen 
entwickelt, Kurse gehalten, Beispielprogramme entwickelt und Artikel in der 
Fachpresse ver&ouml;ffentlicht. Einige Jahre lang habe ich fast im Alleingang zweimal 
j&auml;hrlich eine Serie von Konferenzen in den meisten Europ&auml;ischen L&auml;ndern &uuml;ber 
Neuigkeiten in AutoCAD ausgearbeitet und geleitet.</p>

<p>Zum Thema ADS ver&ouml;ffentlichte ich ein Buch, "Das AutoCAD Development System ADS".</p>

<p>Ich war ma&szlig;geblich beteiligt bei der Gr&uuml;ndung des Entwicklervereins ADGE, 
der AutoCAD Developers Group Europe, der sp&auml;ter &uuml;ber 200 Mitglieder aus 30 
L&auml;ndern z&auml;hlte. Zehn Jahre lang organisierte ADGE zweimal j&auml;hrlich Konferenzen 
in den meisten L&auml;ndern Europas, an denen ich bei der Konzeption stets stark 
involviert war. Bei ADGE leitete ich au&szlig;erdem die fortlaufende Arbeitsgruppe 
ADS, die ca. alle 6 Wochen einen Tag lang stattfand. Die Agenda wurde ad hoc 
erstellt mit den aktuellen Tagesthemen der teilnehmenden Programmierer. 
Ich f&uuml;hrte Protokoll, redigierte, und ver&ouml;ffentlichte das Ergebnis per Email 
und Rundbrief an alle Mitglieder weltweit. F&uuml;r viele externe AutoCAD
Applikationsentwickler stellten die ADS Protokolle jahrelang die 
wichtigste Informationsquelle dar.</p>

<p>Sp&auml;ter war ich aktiver Mitwirkender bei der IAI, die International 
Alliance for Interoperability, mit dem Ziel der Formulierung eines neutralen 
(also herstellerunabh&auml;ngigen) kompletten Geb&auml;udemodells. Ich war verantwortlich 
f&uuml;r die Implementation mehrerer IAI-Demonstrationen f&uuml;r RoCAD und Autodesk. 
Eine Zeitlang war ich auch Chairman of the International Implementation 
Committee der IAI.</p>

<p>Bei RoCAD und redCOR habe ich meine Kollegen, die anfangs nur mit Lisp 
gearbeitet haben, &uuml;ber die Jahre zu professionellen objekt-orientierten 
C++ Programmierern weitergebildet.</p>

</body>
</html>
