<html>
<head>
<title>Jeremy Tammik</title>
<meta http-equiv="content-type" content="text/html; charset=Windows-1252">
<link rel="stylesheet" type="text/css" href="../../jet.css">
</head>
<body>
<h1>Softwareentwicklung</h1>
<ul>
<li>Analyse, Design, Entwicklungsleitung, Programmierung, Consultantt&auml;tigkeiten</li>
</ul>

<p>An der Universit&auml;t machte ich meine ersten Erfahrungen mit Computer an dem 
Mainframe der Physik, der in einem eigenen Haus mit einer einzigen Konsole 
untergebracht war, mit Lochkarten gef&uuml;ttert und in Assembler programmiert wurde. 
In sp&auml;teren Semestern arbeitete ich als Tutor f&uuml;r Basic und Pascal. 
Meine Diplomarbeit &uuml;ber numerische Verfahren zur L&ouml;sung steifer 
Differentialgleichungssystem schrieb ich in Fortran.</p>

<p>Bei CPP Software lernte ich PCs, MS-DOS, die Programmiersprache C, 
und die Arbeit mit der graphischen Benutzeroberfl&auml;che GEM kennen, lange 
bevor Windows auf den Markt kam. Ich war haupts&auml;chlich mit GEM-Applikationen 
besch&auml;ftigt. Unter GEM konnte ich in den Gebieten graphische Bedienerf&uuml;hrung, 
event-driven programming, Multitasking, ger&auml;teunabh&auml;ngiges, portables 
Programmieren und Umgang mit Ger&auml;tetreiber wertvolle Erfahrungen sammeln, 
die ansonsten in der PC-Welt vollkommen vernachl&auml;ssigt wurden.</p>

<p>Bei NTS bestand die erste Aufgabe in einer sehr schnellen Entwicklung und 
Installation eines Kassen-Verbund-System mit dummen Kassenterminalen
auf Basis eines multitasking multiprocessor Z8001 32-bit Kommunikationsmultiplexers, 
bei dem meine Erfahren von CPP extrem n&uuml;tzlich waren.</p>

<p>Bei Autodesk lag meine Hauptaufgabe in Support und Ausbildung der 
"third party application developers", also von externen, unabh&auml;ngigen 
Applikationsentwicklern. Dabei habe ich auch gr&ouml;&szlig;ere Kunden eingehend bei 
der Analyse, Design und Implementation ihrer Applikationen beraten, unter 
anderem die Energieversorgungsfirma Eskom in S&uuml;dafrika in zwei mehrw&ouml;chigen 
Aufenthalten und die Baufirma Hochtief Software in Frankfurt. Bei Autodesk 
arbeitete ich neben PCs auch auf verschiedenen Unix-Varianten von Sun, HP, 
IBM, Apollo, DEC usw.</p>

<p>Sp&auml;ter wurde ich einer der Hauptverantwortlichen f&uuml;r die Realisierung der 
Autodesk Implementation der Industry Foundation Classes IFC der International 
Alliance for Interoperability IAI, die f&uuml;r den herstellerunabh&auml;ngigen 
Datenaustausch von Architektur- und Geb&auml;udemodellen immer gr&ouml;&szlig;ere Bedeutung fand. 
Nach meinem Wechsel zu RoCAD wurde ich wegen meiner vertieften Kenntnisse der IFC 
als Consultant von Autodesk noch mal gebeten, eine neue Implementierung der IFC und 
eine passende Vorf&uuml;hrung dazu als freier Mitarbeiter auszuarbeiten.</p>

<p>Die neue objekt-orientierte Programmierumgebung ObjectARX wurde bei AutoCAD im 
Herbst 1994 eingef&uuml;hrt, gerade nach meinem Wechsel zu RoCAD. Da ich weltweit der 
einzige Supportbetreuer mit hinreichender Erfahrung in C++ und objekt-orientierte 
Programmierung war, hatte ich das Vergn&uuml;gen und die Ehre, in meinen letzten Wochen 
bei Autodesk die ersten Kurse in ARX f&uuml;r einige ausgew&auml;hlte Partner aus USA, Japan 
und Europa abzuhalten.</p>

<p>Bei RoCAD war meine Hauptaufgabe wieder die reine Softwareentwicklung, 
vorrangig des Produktes "RoCAD f&uuml;r die Haustechnik". Eine Ausgangsversion dieses 
Produktes war schon erfolgreich auf dem Markt, in AutoLISP implementiert, ohne 
Pflichtenheft oder interne Dokumentation, und nicht mehr wartbar. Meine Aufgabe 
lag in der Analyse, Design und Neuimplementation in C++. Die vielf&auml;ltigen Bereiche, 
in denen ich bei der Arbeit an RoCAD vertiefte Kenntnisse erworben habe, f&uuml;hre 
ich in dem getrennten Abschnitt <a href="expert.htm">vertieft</a> auf. Viele werden 
auch in dem <a href="pro.htm#asche">Arbeitszeugnis</a> von Christoph Aschenbrenner erw&auml;hnt.</p>

<p>Parallel zu meiner Arbeit an RoCAD unternahm ich auch viele 
<a href="exp.htm">Consultingauftr&auml;ge</a>.</p>

</body>
</html>
